{
  "categories": [
    {
      "id": 1,
      "title": "Furniture",
      "description": "Find stylish and functional pieces for every room in your home.",
      "product": [
        {
          "id": 101,
          "title": "The Oakwood Desk",
          "description": "Solid oak construction meets modern design in this spacious and stylish desk, perfect for your home office.",
          "features": [
            {
              "title": "Adjustable Shelves",
              "description": "Customize your storage to fit your needs with adjustable shelves that can be repositioned to accommodate items of various sizes."
            },
            {
              "title": "Spacious Work Surface",
              "description": "Plenty of space for your computer, paperwork, and more, providing ample room to spread out and work comfortably."
            },
            {
              "title": "Easy Assembly",
              "description": "Quick and simple assembly, so you can start using your desk in no time, with easy-to-follow instructions and minimal tools required."
            },
            {
              "title": "Durable Construction",
              "description": "Built to last with high-quality materials and craftsmanship, ensuring longevity and sturdiness for years to come."
            },
            {
              "title": "Cable Management System",
              "description": "Keep your workspace tidy and organized with integrated cable management to hide cords and cables out of sight."
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "title": "Electronics",
      "description": "Discover the latest in cutting-edge technology for your home and personal use.",
      "product": [
        {
          "id": 201,
          "title": "Smart LED TV",
          "description": "Experience stunning visuals and smart features with this high-definition LED TV.",
          "features": [
            {
              "title": "4K Ultra HD",
              "description": "Enjoy lifelike picture quality with stunning clarity and detail, bringing your favorite movies and shows to life."
            },
            {
              "title": "Smart TV Functionality",
              "description": "Access streaming services, apps, and more with built-in smart features, allowing seamless integration with your favorite content."
            },
            {
              "title": "Multiple HDMI Ports",
              "description": "Connect your favorite devices for a complete entertainment setup, with multiple HDMI ports for easy connectivity."
            },
            {
              "title": "Immersive Sound System",
              "description": "Enhance your viewing experience with immersive sound technology that delivers rich, dynamic audio."
            }
          ]
        }
      ]
    },
    {
      "id": 3,
      "title": "Clothing (Hand made Nepali Clothes)",
      "description": "Discover fashionable and comfortable apparel for every occasion.",
      "product": [
        {
          "id": 301,
          "title": "Men's Casual Shirt",
          "description": "Look stylish and feel comfortable with this versatile casual shirt.",
          "features": [
            {
              "title": "Breathable Fabric",
              "description": "Stay cool and comfortable in any season with breathable fabric that wicks away moisture and promotes airflow."
            },
            {
              "title": "Classic Design",
              "description": "A timeless and versatile design suitable for various casual occasions, offering a sophisticated yet laid-back look."
            },
            {
              "title": "Wrinkle-Resistant Material",
              "description": "Maintain a polished appearance all day with wrinkle-resistant fabric that keeps you looking sharp."
            }
          ]
        }
      ]
    },
    {
      "id": 4,
      "title": "Kitchenware",
      "description": "Find high-quality and functional tools and utensils for your kitchen.",
      "product": [
        {
          "id": 401,
          "title": "Non-Stick Cookware Set",
          "description": "Upgrade your cooking experience with this durable and versatile cookware set.",
          "features": [
            {
              "title": "Non-Stick Coating",
              "description": "Cook with ease and clean up quickly with non-stick surfaces that prevent food from sticking and are easy to wipe clean."
            },
            {
              "title": "Even Heat Distribution",
              "description": "Achieve consistent cooking results with even heat distribution that eliminates hot spots and ensures thorough cooking."
            },
            {
              "title": "Dishwasher Safe",
              "description": "Convenient and easy cleanup with dishwasher-safe compatibility, allowing for effortless maintenance and care."
            },
            {
              "title": "Ergonomic Handles",
              "description": "Handle your cookware with ease and comfort using ergonomically designed handles for a secure grip and effortless maneuvering."
            }
          ]
        }
      ]
    }
  ]
}
